Indicates if to set and get the setting for if shading surfaces should be included.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public bool IncludeShadingSurfaces { get; }
  Visual Basic
Public ReadOnly Property IncludeShadingSurfaces As Boolean
	Get
  Visual C++
public:
property bool IncludeShadingSurfaces {
	bool get ();
}
 See Also
  EnergyAnalysisDetailModel Class
  Autodesk.Revit.DB.Analysis Namespace